src/test/java/rakuten/rconnect/rcv3/bmc/request/ConfirmUnconfirmedBookingRQ.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>#(credential.rcv3.username)</wsse:Username>
                <wsse:Password>#(credential.rcv3.password)</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <S:Body>
        <ConfirmUnconfirmedBookingRQ xmlns="http://travel.rakuten.co.jp/rconnect/schemas">
            <hotelNo>#(hotelId)</hotelNo>
            <sessionId>#(sessionId)</sessionId>
        </ConfirmUnconfirmedBookingRQ>
    </S:Body>
</S:Envelope>